[
  {
    "id": "1",
    "img": "PDP-cart.png",
    "title": "PDP Enhancements",
    "subtitle": "Shopify E‑Commerce",
    "video": "PDP-1-Recording.mp4",
    "tech": [
      {
        "name": "Shopify Liquid",
        "info": "Shopify’s templating language for dynamic theme logic."
      },
      {
        "name": "JavaScript (ES6+)",
        "info": "Modern JS features for dynamic interactivity."
      },
      {
        "name": "Alpine.js",
        "info": "Lightweight reactive JS for frontend interactions."
      },
      {
        "name": "CSS Grid & Flexbox",
        "info": "Responsive layout systems for flexible design."
      },
      {
        "name": "Shopify Metafields API",
        "info": "Custom fields for storing and retrieving product data."
      },
      {
        "name": "Shopify Storefront API (GraphQL)",
        "info": "Fetch store data dynamically via GraphQL."
      },
      {
        "name": "Custom REST APIs",
        "info": "Integrations with external services using REST."
      },
      {
        "name": "LocalStorage",
        "info": "Client-side storage for persisting data like favorites."
      },
      {
        "name": "Fetch API",
        "info": "Modern browser API for making network requests."
      },
      {
        "name": "Lazy Loading Techniques",
        "info": "Optimized asset loading to improve performance."
      }
    ],
    "desc1": "• Redesigned the product gallery into a vertical carousel with image/video support, smooth scrolling, and clickable thumbnails.",
    "desc2": "• Added a dynamic star‑rating system with fractional ratings and live review counts pulled from Shopify metafields and APIs.",
    "desc3": "• Built collapsible info panels (Tell Me More, Scent Notes, Perfumers) with smooth transitions for cleaner content organization.",
    "desc4": "• Integrated subscription purchase options with automatic discount calculations, badges, and instant pricing updates.",
    "desc5": "• Created interactive fragrance and size selectors with real‑time variant switching, updating media and pricing instantly.",
    "desc6": "• Implemented a 'Favorite' system using localStorage and a modal login prompt, with subtle animations and notifications.",
    "desc7": "• Added accessible tooltips for sharing and favoriting actions to improve clarity and usability.",
    "desc8": "• Optimized mobile experience with collapsible data panels, adaptive layouts, and touch‑friendly gestures.",
    "desc9": "• Boosted performance with lazy loading, dynamic height adjustments, and event‑based rendering.",
    "desc10": "• Enhanced accessibility with ARIA labels, focus states, and keyboard navigation support.",
    "desc11": "• Leveraged Shopify metafields (subtitle, notes, inspirations, discounts...) to drive dynamic, easily maintained content.",
    "before": "before-1.png",
    "after": "after-1.png"
  },
  {
    "id": "2",
    "img": "footer-after.png",
    "title": "Responsive Footer Redesign",
    "subtitle": "Shopify Footer Redesign",
    "tech": [
      {
        "name": "Shopify Liquid",
        "info": "Shopify’s templating language used to build dynamic themes."
      },
      {
        "name": "JavaScript (ES6+)",
        "info": "Modern JavaScript features for interactivity and logic."
      },
      {
        "name": "Alpine.js",
        "info": "A lightweight JavaScript framework for simple reactivity."
      },
      {
        "name": "CSS Grid & Flexbox",
        "info": "Advanced CSS layout techniques for responsive designs."
      },
      {
        "name": "Responsive Design Techniques",
        "info": "Ensuring the UI works on all screen sizes."
      },
      {
        "name": "Shopify Theme Schema",
        "info": "Dynamic theme configuration directly in the Shopify editor."
      },
      {
        "name": "Dynamic Linklists",
        "info": "Reusable menu structures powered by Shopify linklists."
      },
      {
        "name": "Fetch API",
        "info": "Modern browser API for making HTTP requests."
      },
      {
        "name": "Custom REST API (Cloudflare Newsletter Integration)",
        "info": "Integration with external APIs for newsletter sign‑ups."
      },
      {
        "name": "Shopify Metafields API",
        "info": "Storing and retrieving custom product data dynamically."
      },
      {
        "name": "Lazy Loading Techniques",
        "info": "Optimizing performance by loading assets on demand."
      },
      {
        "name": "Cross‑Browser Testing & Accessibility",
        "info": "Ensuring consistent behavior and inclusive design."
      }
    ],

    "desc1": "Redesigned the store footer for a cleaner, modern look with improved visual hierarchy and brand consistency.",
    "desc2": "Implemented a fully responsive multi‑column layout with collapsible menus, adaptive spacing, and accessible navigation patterns for seamless usability across devices.",
    "desc3": "Integrated dynamic social media links and contact options, plus a newsletter sign‑up feature powered by a Cloudflare API to capture and process customer data in real time.",
    "desc4": "Developed custom Liquid templates and modular CSS components compatible with Shopify’s schema, allowing merchants to configure menus, social links, and branding directly in the theme editor.",
    "desc5": "Optimized the footer for performance and scalability with semantic HTML, maintainable CSS architecture, and clear code organization.",
    "desc6": "Ensured cross‑browser compatibility and tested responsive behaviors extensively to deliver a polished, production‑ready design.",
    "before": "footer-before.png",
    "after": "footer-after.png",
    "video": "footer-recording.mp4"
  },
  {
    "id": "3",
    "img": "videos-cart.png",
    "title": "Interactive Shorts Feature",
    "subtitle": "Custom Video Carousel",
    "tech": [
      {
        "name": "Shopify Liquid",
        "info": "Shopify’s templating language for building dynamic sections."
      },
      {
        "name": "Shopify Metafields API",
        "info": "Used to store and retrieve custom content for videos and metadata."
      },
      {
        "name": "JavaScript (ES6+)",
        "info": "Modern JavaScript features to implement carousel and video controls."
      },
      {
        "name": "Alpine.js",
        "info": "Lightweight framework to add interactivity without heavy overhead."
      },
      {
        "name": "Fetch API",
        "info": "Handles data requests for videos and dynamic loading of content."
      },
      {
        "name": "History API (pushState & popstate)",
        "info": "Allows seamless navigation and state management in the video carousel."
      },
      {
        "name": "CSS Grid & Flexbox",
        "info": "Used for layout of the carousel and responsive video sections."
      },
      {
        "name": "Responsive Design Techniques",
        "info": "Ensures the video carousel and player work across all devices."
      },
      {
        "name": "Dynamic DOM Manipulation",
        "info": "Enables updating video elements, metadata, and UI on the fly."
      },
      {
        "name": "Clipboard API (Copy to Clipboard)",
        "info": "Implements sharing features by copying video links to the clipboard."
      },
      {
        "name": "Video Element Controls",
        "info": "Customizes playback, pause, fullscreen, and download behavior."
      }
    ],

    "intro": "This project introduced a completely new interactive video shorts section. I implemented the layout, carousel, and player controls from scratch, integrating share options and downloadable content according to the provided design.",
    "desc1": "Built a custom video carousel component with seamless navigation and responsive layout.",
    "desc2": "Integrated dynamic data from Shopify articles and metafields to load video content and metadata in real time.",
    "desc3": "Implemented share, and download for each video.",
    "desc4": "Optimized for mobile with touch‑friendly controls and adaptive layouts.",
    "carousel": ["videos-3.png", "videos-1.png", "videos-2.png"],
    "video": "shorts-recording.mp4"
  }
]
