[
  {
    "id": "1",
    "img": "PDP-cart.png",
    "title": "PDP Enhancements",
    "subtitle": "Shopify E‑Commerce",
    "video": "PDP-1-Recording.mp4",
    "tech": [
      "Shopify Liquid",
      "JavaScript (ES6+)",
      "Alpine.js",
      "CSS Grid & Flexbox",
      "Shopify Metafields API",
      "Shopify Storefront API (GraphQL)",
      "Custom REST APIs",
      "LocalStorage",
      "Fetch API",
      "Lazy Loading Techniques"
    ],
    "desc1": "• Redesigned the product gallery into a vertical carousel with image/video support, smooth scrolling, and clickable thumbnails.",
    "desc2": "• Added a dynamic star‑rating system with fractional ratings and live review counts pulled from Shopify metafields and APIs.",
    "desc3": "• Built collapsible info panels (Tell Me More, Scent Notes, Perfumers) with smooth transitions for cleaner content organization.",
    "desc4": "• Integrated subscription purchase options with automatic discount calculations, badges, and instant pricing updates.",
    "desc5": "• Created interactive fragrance and size selectors with real‑time variant switching, updating media and pricing instantly.",
    "desc6": "• Implemented a 'Favorite' system using localStorage and a modal login prompt, with subtle animations and notifications.",
    "desc7": "• Added accessible tooltips for sharing and favoriting actions to improve clarity and usability.",
    "desc8": "• Optimized mobile experience with collapsible data panels, adaptive layouts, and touch‑friendly gestures.",
    "desc9": "• Boosted performance with lazy loading, dynamic height adjustments, and event‑based rendering.",
    "desc10": "• Enhanced accessibility with ARIA labels, focus states, and keyboard navigation support.",
    "desc11": "• Leveraged Shopify metafields (subtitle, notes, inspirations, discounts...) to drive dynamic, easily maintained content.",
    "before": "before-1.png",
    "after": "after-1.png"
  },
  {
    "id": "2",
    "img": "footer-after.png",
    "title": "Responsive Footer Redesign",
    "subtitle": "Shopify Footer Redesign",
    "tech": [
      "Shopify Liquid",
      "JavaScript (ES6+)",
      "Alpine.js",
      "CSS Grid & Flexbox",
      "Responsive Design Techniques",
      "Shopify Theme Schema",
      "Dynamic Linklists",
      "Fetch API",
      "Custom REST API (Cloudflare Newsletter Integration)",
      "Shopify Metafields API",
      "Lazy Loading Techniques",
      "Cross‑Browser Testing & Accessibility"
    ],
    "desc1": "Redesigned the store footer for a cleaner, modern look with improved visual hierarchy and brand consistency.",
    "desc2": "Implemented a fully responsive multi‑column layout with collapsible menus, adaptive spacing, and accessible navigation patterns for seamless usability across devices.",
    "desc3": "Integrated dynamic social media links and contact options, plus a newsletter sign‑up feature powered by a Cloudflare API to capture and process customer data in real time.",
    "desc4": "Developed custom Liquid templates and modular CSS components compatible with Shopify’s schema, allowing merchants to configure menus, social links, and branding directly in the theme editor.",
    "desc5": "Optimized the footer for performance and scalability with semantic HTML, maintainable CSS architecture, and clear code organization.",
    "desc6": "Ensured cross‑browser compatibility and tested responsive behaviors extensively to deliver a polished, production‑ready design.",
    "before": "footer-before.png",
    "after": "footer-after.png",
    "video": "footer-recording.mp4"
  },
  {
    "id": "3",
    "img": "videos-cart.png",
    "title": "Interactive Shorts Feature",
    "subtitle": "Custom Video Carousel",
    "tech": [
      "Shopify Liquid",
      "Shopify Metafields API",
      "JavaScript (ES6+)",
      "Alpine.js",
      "Fetch API",
      "History API (pushState & popstate)",
      "CSS Grid & Flexbox",
      "Responsive Design Techniques",
      "Dynamic DOM Manipulation",
      "Clipboard API (Copy to Clipboard)",
      "Video Element Controls"
    ],
    "intro": "This project introduced a completely new interactive video shorts section. I implemented the layout, carousel, and player controls from scratch, integrating share options and downloadable content according to the provided design.",
    "desc1": "Built a custom video carousel component with seamless navigation and responsive layout.",
    "desc2": "Integrated dynamic data from Shopify articles and metafields to load video content and metadata in real time.",
    "desc3": "Implemented share, and download for each video.",
    "desc4": "Optimized for mobile with touch‑friendly controls and adaptive layouts.",
    "carousel": ["videos-1.png", "videos-2.png", "videos-3.png"],
    "video": "shorts-recording.mp4"
  }
]
